PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p16f1618.inc
;----- PID1K3H Bits -----------------------------------------------------
PID1K38          EQU  H'0000'
PID1K39          EQU  H'0001'
PID1K310         EQU  H'0002'
PID1K311         EQU  H'0003'
PID1K312         EQU  H'0004'
PID1K313         EQU  H'0005'
PID1K314         EQU  H'0006'
PID1K315         EQU  H'0007'

K38              EQU  H'0000'
K39              EQU  H'0001'
K310             EQU  H'0002'
K311             EQU  H'0003'
K312             EQU  H'0004'
K313             EQU  H'0005'
K314             EQU  H'0006'
K315             EQU  H'0007'


;----- PID1OUTLL Bits -----------------------------------------------------
PID1OUT0         EQU  H'0000'
PID1OUT1         EQU  H'0001'
PID1OUT2         EQU  H'0002'
PID1OUT3         EQU  H'0003'
PID1OUT4         EQU  H'0004'
PID1OUT5         EQU  H'0005'
PID1OUT6         EQU  H'0006'
PID1OUT7         EQU  H'0007'

OUT0             EQU  H'0000'
OUT1             EQU  H'0001'
OUT2             EQU  H'0002'
OUT3             EQU  H'0003'
OUT4             EQU  H'0004'
OUT5             EQU  H'0005'
OUT6             EQU  H'0006'
OUT7             EQU  H'0007'


;----- PID1OUTLH Bits -----------------------------------------------------
PID1OUT8         EQU  H'0000'
PID1OUT9         EQU  H'0001'
PID1OUT10        EQU  H'0002'
PID1OUT11        EQU  H'0003'
PID1OUT12        EQU  H'0004'
PID1OUT13        EQU  H'0005'
PID1OUT14        EQU  H'0006'
PID1OUT15        EQU  H'0007'

OUT8             EQU  H'0000'
OUT9             EQU  H'0001'
OUT10            EQU  H'0002'
OUT11            EQU  H'0003'
OUT12            EQU  H'0004'
OUT13            EQU  H'0005'
OUT14            EQU  H'0006'
OUT15            EQU  H'0007'


;----- PID1OUTHL Bits -----------------------------------------------------
PID1OUT16        EQU  H'0000'
PID1OUT17        EQU  H'0001'
PID1OUT18        EQU  H'0002'
PID1OUT19        EQU  H'0003'
PID1OUT20        EQU  H'0004'
PID1OUT21        EQU  H'0005'
PID1OUT22        EQU  H'0006'
PID1OUT23        EQU  H'0007'

OUT16            EQU  H'0000'
OUT17            EQU  H'0001'
OUT18            EQU  H'0002'
OUT19            EQU  H'0003'
OUT20            EQU  H'0004'
OUT21            EQU  H'0005'
OUT22            EQU  H'0006'
OUT23            EQU  H'0007'


;----- PID1OUTHH Bits -----------------------------------------------------
PID1OUT24        EQU  H'0000'
PID1OUT25        EQU  H'0001'
PID1OUT26        EQU  H'0002'
PID1OUT27        EQU  H'0003'
PID1OUT28        EQU  H'0004'
PID1OUT29        EQU  H'0005'
PID1OUT30        EQU  H'0006'
PID1OUT31        EQU  H'0007'

OUT24            EQU  H'0000'
OUT25            EQU  H'0001'
OUT26            EQU  H'0002'
OUT27            EQU  H'0003'
OUT28            EQU  H'0004'
OUT29            EQU  H'0005'
OUT30            EQU  H'0006'
OUT31            EQU  H'0007'


;----- PID1OUTU Bits -----------------------------------------------------
PID1OUT32        EQU  H'0000'
PID1OUT33        EQU  H'0001'
PID1OUT34        EQU  H'0002'
PID1OUT35        EQU  H'0003'

OUT32            EQU  H'0000'
OUT33            EQU  H'0001'
OUT34            EQU  H'0002'
OUT35            EQU  H'0003'


;----- PID1Z1L Bits -----------------------------------------------------
PID1Z10          EQU  H'0000'
PID1Z11          EQU  H'0001'
PID1Z12          EQU  H'0002'
PID1Z13          EQU  H'0003'
PID1Z14          EQU  H'0004'
PID1Z15          EQU  H'0005'
PID1Z16          EQU  H'0006'
PID1Z17          EQU  H'0007'

Z10              EQU  H'0000'
Z11              EQU  H'0001'
Z12              EQU  H'0002'
Z13              EQU  H'0003'
Z14              EQU  H'0004'
Z15              EQU  H'0005'
Z16              EQU  H'0006'
Z17              EQU  H'0007'


;----- PID1Z1H Bits -----------------------------------------------------
PID1Z18          EQU  H'0000'
PID1Z19          EQU  H'0001'
PID1Z110         EQU  H'0002'
PID1Z111         EQU  H'0003'
PID1Z112         EQU  H'0004'
PID1Z113         EQU  H'0005'
PID1Z114         EQU  H'0006'
PID1Z115         EQU  H'0007'

Z18              EQU  H'0000'
Z19              EQU  H'0001'
Z110             EQU  H'0002'
Z111             EQU  H'0003'
Z112             EQU  H'0004'
Z113             EQU  H'0005'
Z114             EQU  H'0006'
Z115             EQU  H'0007'


;----- PID1Z1U Bits -----------------------------------------------------
PID1Z116         EQU  H'0000'

Z116             EQU  H'0000'


;----- PID1Z2L Bits -----------------------------------------------------
PID1Z20          EQU  H'0000'
PID1Z21          EQU  H'0001'
PID1Z22          EQU  H'0002'
PID1Z23          EQU  H'0003'
PID1Z24          EQU  H'0004'
PID1Z25          EQU  H'0005'
PID1Z26          EQU  H'0006'
PID1Z27          EQU  H'0007'

Z20              EQU  H'0000'
Z21              EQU  H'0001'
Z22              EQU  H'0002'
Z23              EQU  H'0003'
Z24              EQU  H'0004'
Z25              EQU  H'0005'
Z26              EQU  H'0006'
Z27              EQU  H'0007'


;----- PID1Z2H Bits -----------------------------------------------------
PID1Z28          EQU  H'0000'
PID1Z29          EQU  H'0001'
PID1Z210         EQU  H'0002'
PID1Z211         EQU  H'0003'
PID1Z212         EQU  H'0004'
PID1Z213         EQU  H'0005'
PID1Z214         EQU  H'0006'
PID1Z215         EQU  H'0007'

Z28              EQU  H'0000'
Z29              EQU  H'0001'
Z210             EQU  H'0002'
Z211             EQU  H'0003'
Z212             EQU  H'0004'
Z213             EQU  H'0005'
Z214             EQU  H'0006'
Z215             EQU  H'0007'


;----- PID1Z2U Bits -----------------------------------------------------
PID1Z216         EQU  H'0000'

Z216             EQU  H'0000'


;----- PID1ACCLL Bits -----------------------------------------------------
PID1ACC0         EQU  H'0000'
PID1ACC1         EQU  H'0001'
PID1ACC2         EQU  H'0002'
PID1ACC3         EQU  H'0003'
PID1ACC4         EQU  H'0004'
PID1ACC5         EQU  H'0005'
PID1ACC6         EQU  H'0006'
PID1ACC7         EQU  H'0007'

ACC0             EQU  H'0000'
ACC1             EQU  H'0001'
ACC2             EQU  H'0002'
ACC3             EQU  H'0003'
ACC4             EQU  H'0004'
ACC5             EQU  H'0005'
ACC6             EQU  H'0006'
ACC7             EQU  H'0007'


;----- PID1ACCLH Bits -----------------------------------------------------
PID1ACC8         EQU  H'0000'
PID1ACC9         EQU  H'0001'
PID1ACC10        EQU  H'0002'
PID1ACC11        EQU  H'0003'
PID1ACC12        EQU  H'0004'
PID1ACC13        EQU  H'0005'
PID1ACC14        EQU  H'0006'
PID1ACC15        EQU  H'0007'

ACC8             EQU  H'0000'
ACC9             EQU  H'0001'
ACC10            EQU  H'0002'
ACC11            EQU  H'0003'
ACC12            EQU  H'0004'
ACC13            EQU  H'0005'
ACC14            EQU  H'0006'
ACC15            EQU  H'0007'


